Public Class Form4
    'Public verni As Integer

    Public answers(14) As String
    Public num As Integer

    Public fail As Integer = 0

    Public questions = New String(,) {{"Пътният банкет е част от:", "Платното за движение", "Пътното платно", "Най-дясната пътна лента", "Пътното платно"}, _
        {"Как се променя сцеплението на гуми с пътя при заледена настилка?", "Увеличава се", "Намалява", "Не се променя", "Намалява"}, _
        {"Разрешено ли е на водачите на двуколесни МПС да се движат успоредно един до друг?", "Да, когато се вместват в една пътна лента", "Да, но само в населени места", "Не", "Не"}, _
        {"Къде по пътищата извън населените места е разрешен престоят?", "Само извън платното за движение", "Най-вдясно на пътното платно", "Само на означените за тази цел места", "Най-вдясно на пътното платно"}, _
        {"Тротоарът е част от:", "Пътното платно", "Платното за движение", "Най-дясната пътна лента", "Пътното платно"}, _
        {"Как се изменя сцеплението на автомобилните гуми с пътя при мокра настилка?", "Увеличава се", "Намалява", "Не се променя", "Намалява"}, _
        {"Изпреварването е забранено:", "Когато се извършва по двулентов път", "Когато при използване на пътна лента за насрещното движение не е възможно безпрепятствено връщане в напуснатата лента", "Когато изпреварващият автомобил е с повредени пътепоказатели", "Когато при използване на пътна лента за насрещното движение не е възможно безпрепятствено връщане в напуснатата лента"}, _
        {"На водачите на мотопеди и велосипедисти е забранено да се движат:", "По пътния банкет", "В непосредствена близост до друго МПС", "С включени светлини през деня", "В непосредствена близост до друго МПС"}, _
        {"Къде по пътищата извън населените места е разрешено паркирането?", "Най-вдясно на платното за движение", "Само извън платното за движение", "Само на означените за тази цел места", "Само извън платното за движение"}, _
        {"Превключването от дълги на къси светлини, преди разминаване през нощта се извършва, когато разстоянието между двата автомобила е:", "Не по-малко от 50м", "Не по-малко от 100м", "Не по-малко от 150м", "Не по-малко от 150м"}, _
        {"За по-голяма безопасност, при пътуване на дълги разстояния, водачът с по-малко опит трябва:", "Да избягва пътуването през нощта", "Да избягва движението по автомагистрали", "Да се движи бавно", "Да се движи бавно"}, _
        {"Пониженото налягане на въздуха в автомобилните гуми води до:", "Увеличаване разхода на гориво", "Увеличаване на устойчивостта на автомобила в завой", "Намаляване разхода на гориво", "Увеличаване разхода на гориво"}, _
        {"За да участва в движението, МПС задължително трябва да бъде:", "Със сключена застраховка Каско", "Оборудвано с инструменти за ремонт", "Регистрирано", "Регистрирано"}, _
        {"Разрешено ли е използването на мобилен телефон по време на управление на превозното средство?", "Не, освен при наличие на устройство, позволяващо използването на телефона без участието на ръцете", "Да, без ограничения", "Не, забранено във всички случаи", "Не, освен при наличие на устройство, позволяващо използването на телефона без участието на ръцете"}, _
    {"В кои от изброените случаи водачът е длъжен да се върне на мястото на ПТП, след като е превозил пострадал до болнично заведение?", "Когато е участник в произшествието  ", "Когато превозването е било разпоредено от органите за контрол", "Винаги, независимо от това дали е участник в произшествието", "Когато е участник в произшествието"}}

    Private Sub Button1_Click(sender As Object, e As EventArgs) Handles Button1.Click

        For Each item In Me.Controls
            item.visible = True
        Next
        Button1.Visible = False

        'randomize method!!
        Randomize()
        num = Int(Rnd() * 15) + 1

        Label2.Text = questions(num - 1, 0)

        Button2.Text = "Submit Answer!"
        RadioButton1.Text = questions(num - 1, 1)
        RadioButton2.Text = questions(num - 1, 2)
        RadioButton3.Text = questions(num - 1, 3)

    End Sub

    Private Sub Form1_Load(ByVal sender As Object, ByVal e As EventArgs) Handles Me.Load

    End Sub

    Private Sub Form1_FormClosing(ByVal sender As Object, ByVal e As FormClosingEventArgs) Handles MyBase.FormClosing
        Application.Exit()
    End Sub

    Private Sub Button2_Click(ByVal sender As Object, ByVal e As EventArgs) Handles Button2.Click

        If RadioButton1.Checked = True Then
            answers(num - 1) = RadioButton1.Text
        ElseIf RadioButton2.Checked = True Then
            answers(num - 1) = RadioButton2.Text
        ElseIf RadioButton3.Checked = True Then
            answers(num - 1) = RadioButton3.Text
        End If
        RadioButton1.Focus()



        If answers(num - 1) <> questions(num - 1, 4) Then
            fail += 1
        End If


        If fail = 3 Then
            Label2.Text = "GAME OVER! Ти даде 3 грешни отговора!" & vbCrLf & "Изкара " & Form1.scorecounter & " точки!"
            Form1.Score.Enabled = False
            RadioButton1.Enabled = False
            RadioButton2.Enabled = False
            RadioButton3.Enabled = False
            Button2.Enabled = False
        Else

            For Each item In Me.Controls
                item.visible = False
            Next
            Button1.Visible = True
            Form1.Show()
            Me.Hide()
        End If

    End Sub

End Class